In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']},
                        columns = ['author_id', 'author_name'])
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [3]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290]},
                     columns =['author_id', 'book_title', 'price'])
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [4]:
author_price = pd.merge(authors, book, on = 'author_id', how = 'left')
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [5]:
top5 = author_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [6]:
authors_stat = authors['author_name']
authors_stat = pd.DataFrame(authors_stat)
authors_stat

  author_name
0    Тургенев
1       Чехов
2  Островский

In [7]:
min_price = author_price.groupby('author_name')['price'].min()
min_price = pd.DataFrame({'author_name': min_price.index, 'min_price': min_price.values})
min_price

  author_name  min_price
0  Островский        290
1    Тургенев        300
2       Чехов        450

In [8]:
max_price = author_price.groupby('author_name')['price'].max()
max_price = pd.DataFrame({'author_name': max_price.index, 'max_price': max_price.values})
max_price

  author_name  max_price
0  Островский        370
1    Тургенев        450
2       Чехов        500

In [9]:
mean_price = author_price.groupby('author_name')['price'].mean()
mean_price = pd.DataFrame({'author_name': mean_price.index, 'mean_price': mean_price.values})
mean_price

  author_name  mean_price
0  Островский  330.000000
1    Тургенев  366.666667
2       Чехов  475.000000

In [10]:
authors_stat = pd.merge(authors_stat, min_price, on = 'author_name', how = 'left')
authors_stat = pd.merge(authors_stat, max_price, on = 'author_name', how = 'left')
authors_stat = pd.merge(authors_stat, mean_price, on = 'author_name', how = 'left')
authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        300        450  366.666667
1       Чехов        450        500  475.000000
2  Островский        290        370  330.000000

In [11]:
author_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
author_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [12]:
#?pd.pivot_table

In [13]:
book_info = author_price.pivot_table('price', index = 'author_name', columns = 'cover', aggfunc='mean', fill_value = 0)
book_info

cover        мягкая  твердая
author_name
Островский      330        0
Тургенев        325      450
Чехов             0      475

In [14]:
book_info.to_pickle('book_info.pkl')

In [15]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский      330        0
Тургенев        325      450
Чехов             0      475

#### Если нет исключения, значит датафреймы равны

In [16]:
from pandas.util.testing import assert_frame_equal
assert_frame_equal(book_info, book_info2)

##### Другой вариант сравнения

In [17]:
book_info.equals(book_info2)

True

In [18]:
book_info.index == book_info2.index

array([ True,  True,  True])